In [1]:
import pandas as pd

In [2]:
dic = {'Name':['jaz', 'Raz', 'Max'], 'Age':[23, 24, 25], 'Marks':[78,89.5]}
dic

{'Name': ['jaz', 'Raz', 'Max'], 'Age': [23, 24, 25], 'Marks': [78, 89.5]}

In [3]:
# Throw an error because in Marks 1 value is missing

# df = pd.DataFrame(dic)
# df

In [4]:
dic1 = {'Name':['jaz', 'Raz', 'Max'], 'Age':[23, 24, 25], 'Marks':[78,89.5, 98]}
dic1

{'Name': ['jaz', 'Raz', 'Max'], 'Age': [23, 24, 25], 'Marks': [78, 89.5, 98]}

In [5]:
df1 = pd.DataFrame(dic1, index = ['a', 'b', 'c'])
df1

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5
c  Max   25   98.0

In [6]:
df1['Name']

a    jaz
b    Raz
c    Max
Name: Name, dtype: object

In [7]:
df1['Age']

a    23
b    24
c    25
Name: Age, dtype: int64

In [8]:
df1['Marks']

a    78.0
b    89.5
c    98.0
Name: Marks, dtype: float64

In [9]:
df1.loc['a', 'Name']

'jaz'

In [10]:
df1.loc['a':'c']

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5
c  Max   25   98.0

In [11]:
df1.loc[:]

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5
c  Max   25   98.0

In [12]:
df1.loc['a':'c', 'Name']

a    jaz
b    Raz
c    Max
Name: Name, dtype: object

In [13]:
df1.loc[['a', 'c']]

  Name  Age  Marks
a  jaz   23   78.0
c  Max   25   98.0

In [14]:
df1.loc[['a', 'b'], 'Name']

a    jaz
b    Raz
Name: Name, dtype: object

In [15]:
df1.loc[['a','b','c'], ['Name', 'Marks']]

  Name  Marks
a  jaz   78.0
b  Raz   89.5
c  Max   98.0

In [16]:
df1[['Name', 'Marks']]

  Name  Marks
a  jaz   78.0
b  Raz   89.5
c  Max   98.0

In [17]:
df1.iloc[0:2]

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5

In [18]:
df1.iloc[:]

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5
c  Max   25   98.0

In [19]:
df1.iloc[[0,2]]

  Name  Age  Marks
a  jaz   23   78.0
c  Max   25   98.0

In [20]:
cols = ['Name', 'Marks']
df1[cols]

  Name  Marks
a  jaz   78.0
b  Raz   89.5
c  Max   98.0

In [21]:
df1.iloc[:]

  Name  Age  Marks
a  jaz   23   78.0
b  Raz   24   89.5
c  Max   25   98.0

In [22]:
df1.iloc[: , 2]

a    78.0
b    89.5
c    98.0
Name: Marks, dtype: float64

In [23]:
df1['Height'] = [5.5, 4.9, 5.3]

In [24]:
df1

  Name  Age  Marks  Height
a  jaz   23   78.0     5.5
b  Raz   24   89.5     4.9
c  Max   25   98.0     5.3

In [25]:
type(df1)

pandas.core.frame.DataFrame

In [26]:
df1.loc[3, 'Name'] = 'shaaz'
df1

    Name   Age  Marks  Height
a    jaz  23.0   78.0     5.5
b    Raz  24.0   89.5     4.9
c    Max  25.0   98.0     5.3
3  shaaz   NaN    NaN     NaN

# Series

In [27]:
df2 = pd.Series([2,3,4,5,6])
df2

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [28]:
df1.index

Index(['a', 'b', 'c', 3], dtype='object')

In [29]:
df1.columns

Index(['Name', 'Age', 'Marks', 'Height'], dtype='object')

In [30]:
type(df2)

pandas.core.series.Series

# DataFrame from CSV

In [31]:
data = pd.read_csv("Ecommerce Purchases.csv")
data

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [32]:
data.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [33]:
data.tail()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [34]:
data.iloc[:, 3]

0       Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...
1       Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...
2       Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...
3       Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...
4       Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...
                              ...
9995    Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...
9996    Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...
9997    Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...
9998    Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...
9999    Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...
Name: Browser Info, Length: 10000, dtype: object

In [35]:
data['Address']

0       16629 Pace Camp Apt. 448\nAlexisborough, NE 77...
1       9374 Jasmine Spurs Suite 508\nSouth John, TN 8...
2                        Unit 0065 Box 5052\nDPO AP 27450
3                   7780 Julia Fords\nNew Stacy, WA 45798
4       23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...
                              ...
9995        966 Castaneda Locks\nWest Juliafurt, CO 96415
9996    832 Curtis Dam Suite 785\nNorth Edwardburgh, T...
9997                Unit 4434 Box 6343\nDPO AE 28026-0283
9998                 0096 English Rest\nRoystad, IA 12457
9999       40674 Barrett Stravenue\nGrimesville, WI 79682
Name: Address, Length: 10000, dtype: object

In [36]:
type(data)

pandas.core.frame.DataFrame

In [37]:
import pandas as pd

# Setting maximum rows to be shown 
pd.options.display.max_rows = 20

# Setting minimum rows to be shown
pd.set_option("display.min_rows", 5)

# Print DataFrame
print(data)

                                                Address    Lot AM or PM  \
0     16629 Pace Camp Apt. 448\nAlexisborough, NE 77...  46 in       PM
1     9374 Jasmine Spurs Suite 508\nSouth John, TN 8...  28 rn       PM
...                                                 ...    ...      ...
9998               0096 English Rest\nRoystad, IA 12457  74 cL       PM
9999     40674 Barrett Stravenue\nGrimesville, WI 79682  64 Hr       AM

                                           Browser Info  \
0     Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...
1     Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...
...                                                 ...
9998  Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...
9999  Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...

                              Company       Credit Card CC Exp Date  \
0                     Martinez-Herman  6011929061123406       02/20
1     Fletcher, Richards and Whitaker  3337758169645356       11/18
...                               ...               ...         ...
9998                         Cook Inc   180003348082930       11/17
9999                       Greene Inc  4139972901927273       02/19

      CC Security Code       CC Provider                    Email  \
0                  900      JCB 16 digit        pdunlap@yahoo.com
1                  561        Mastercard       anthony41@reed.com
...                ...               ...                      ...
9998               987  American Express  elizabethmoore@reid.net
9999               302      JCB 15 digit    rachelford@vaughn.com

                                         Job       IP Address Language  \
0     Scientist, product/process development  149.146.147.205       el
1                          Drilling engineer     15.160.41.51       fr
...                                      ...              ...      ...
9998                Local government officer     55.78.26.143       es
9999                  Embryologist, clinical  176.119.198.199       el

      Purchase Price
0              98.14
1              70.73
...              ...
9998           38.84
9999           67.59

[10000 rows x 14 columns]

# DataFrame metadata

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

## Get the statistics of DataFrame

### DataFrame.describe() is a function that gives mathematical statistics of the data in DataFrame. But, it applies to the columns that contain numeric values.

In our example of student DataFrame, it gives descriptive statistics of 'Age' and 'Marks' columns only, that includes:

count: Total number of non-null values in the column
mean: an average of numbers
std: a standard deviation value
min: minimum value
25%: 25th percentile
50%: 50th percentile
75%: 75th percentile
max: maximum value

In [39]:
data.describe()

        Credit Card  CC Security Code  Purchase Price
count  1.000000e+04      10000.000000    10000.000000
mean   2.341374e+15        907.217800       50.347302
std    2.256103e+15       1589.693035       29.015836
min    6.040186e+10          0.000000        0.000000
25%    3.056322e+13        280.000000       25.150000
50%    8.699942e+14        548.000000       50.505000
75%    4.492298e+15        816.000000       75.770000
max    6.012000e+15       9993.000000       99.990000

In [40]:
df1.count()

Name      4
Age       3
Marks     3
Height    3
dtype: int64

In [41]:
df1.max()

Name      shaaz
Age        25.0
Marks      98.0
Height      5.5
dtype: object

In [42]:
df1.mean()

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_31540\2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

Age       24.000000
Marks     88.500000
Height     5.233333
dtype: float64

In [43]:
df1.std()

C:\Users\ramya.yande\AppData\Local\Temp\ipykernel_31540\3039516898.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.std()

Age        1.000000
Marks     10.037430
Height     0.305505
dtype: float64

## DataFrame Attributes

DataFrame has provided many built-in attributes. Attributes do not modify the underlying data, unlike functions, but it is used to get more details about the DataFrame.

### # Attribute	Description
DataFrame.index	It gives the Range of the row index
DataFrame.columns	It gives a list of column labels
DataFrame.dtypes	It gives column names and their data type
DataFrame.values	It gives all the rows in DataFrame
DataFrame.empty	It is used to check if the DataFrame is empty
DataFrame.size	It gives a total number of values in DataFrame
DataFrame.shape	It a number of rows and columns in DataFrame

In [44]:
# Create DataFrame from dict
student_dict = {'Name': ['Joe', 'Nat', 'Harry'], 'Age': [20, 21, 19], 'Marks': [85.10, 77.80, 91.54]}

student_df = pd.DataFrame(student_dict)

print("DataFrame : ", student_df)

print("DataFrame Index : ", student_df.index)
print("DataFrame Columns : ", student_df.columns)

print("DataFrame Column types : ", student_df.dtypes)

print("DataFrame is empty? : ", student_df.empty)

print("DataFrame Shape : ", student_df.shape)
print("DataFrame Size : ", student_df.size)

print("DataFrame Values : ", student_df.values)

DataFrame :      Name  Age  Marks
0    Joe   20  85.10
1    Nat   21  77.80
2  Harry   19  91.54
DataFrame Index :  RangeIndex(start=0, stop=3, step=1)
DataFrame Columns :  Index(['Name', 'Age', 'Marks'], dtype='object')
DataFrame Column types :  Name      object
Age        int64
Marks    float64
dtype: object
DataFrame is empty? :  False
DataFrame Shape :  (3, 3)
DataFrame Size :  9
DataFrame Values :  [['Joe' 20 85.1]
 ['Nat' 21 77.8]
 ['Harry' 19 91.54]]